SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
/*!
    \file    gd32e23x_hal_rtc.c
    \brief   RTC driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

static hal_rtc_irq_struct rtc_irq = {NULL,NULL,NULL,NULL};

/*!
    \brief      initialize the specified structure
    \param[in]  hal_struct_type: 
                  the argument could be selected from enumeration <hal_rtc_struct_type_enum>
    \param[in]  p_struct: point to the structure to be deinitialized    
    \param[out] none
    \retval     none
*/
void hal_rtc_struct_init(hal_rtc_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == p_struct){
        HAL_DEBUGE("parameter [*p_struct] value is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    switch(hal_struct_type){
    case HAL_RTC_INIT_STRUCT:
        /* initialize RTC initialization structure with the default values */
        ((hal_rtc_init_struct*)p_struct)->rtc_year = 0x00;
        ((hal_rtc_init_struct*)p_struct)->rtc_month = HAL_RTC_JAN;
        ((hal_rtc_init_struct*)p_struct)->rtc_date = 0x1;
        ((hal_rtc_init_struct*)p_struct)->rtc_day_of_week = HAL_RTC_MONDAY;
        ((hal_rtc_init_struct*)p_struct)->rtc_hour = 0x0;
        ((hal_rtc_init_struct*)p_struct)->rtc_minute = 0x0;
        ((hal_rtc_init_struct*)p_struct)->rtc_second = 0x0;
        ((hal_rtc_init_struct*)p_struct)->rtc_subsecond = 0x0;    
        ((hal_rtc_init_struct*)p_struct)->rtc_factor_asyn = 0x63;    
        ((hal_rtc_init_struct*)p_struct)->rtc_factor_syn = 0x18F;
        ((hal_rtc_init_struct*)p_struct)->rtc_am_pm = HAL_RTC_AM;
        ((hal_rtc_init_struct*)p_struct)->rtc_display_format = HAL_RTC_24HOUR;
        
        break;
    
    case HAL_RTC_ALARM_STRUCT:
        /* initialize RTC device alarm function structure with the default values */
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_mask = HAL_RTC_ALARM_NONE_MASK;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_weekday_or_date = HAL_RTC_ALARM_DATE_SELECTED;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_day = 0x1;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_hour = 0x0;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_minute = 0x0;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_second = 0x0;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_subsecond = 0x0;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_alarm_subsecond_mask = HAL_RTC_MASK_SUBSECOND;
        ((hal_rtc_alarm_struct*)p_struct)->rtc_am_pm = HAL_RTC_AM;
    
        break;

    case HAL_RTC_TIMESTAMP_STRUCT:
        /* initialize RTC device timestamp function structure with the default values */
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_month = RTC_JAN;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_date = 0x1;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_day = RTC_MONDAY;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_hour = 0x0;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_minute = 0x0;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_second = 0x0;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_timestamp_subsecond = 0x0;
        ((hal_rtc_timestamp_struct*)p_struct)->rtc_am_pm = HAL_RTC_AM;
    
        break;

    case HAL_RTC_TAMPER_STRUCT:
        /* initialize RTC device tamper function structure with the default values */
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_source = HAL_RTC_TAMPER1;
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_trigger = HAL_RTC_TAMPER_EDGE_RISING;
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_filter = HAL_RTC_FILTER_EDGE;
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_sample_frequency = HAL_RTC_FREQ_DIV32768;
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_precharge_enable = DISABLE;
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_precharge_time = HAL_RTC_1_CLK_PRECHARGE;
        ((hal_rtc_tamper_struct*)p_struct)->rtc_tamper_with_timestamp = DISABLE;
    
        break;    

    case HAL_RTC_IRQ_STRUCT:
        /* initialize RTC device interrupt callback function structure with the default values */
        ((hal_rtc_irq_struct*)p_struct)->alarm_handle = NULL;
        ((hal_rtc_irq_struct*)p_struct)->timestamp_handle = NULL;
        ((hal_rtc_irq_struct*)p_struct)->tamper0_handle = NULL;
        ((hal_rtc_irq_struct*)p_struct)->tamper1_handle = NULL;
        
        break;
    
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize RTC 
    \param[in]  none
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_deinit(void)
{
    ErrStatus error_status = ERROR;
    int32_t ret_status = HAL_ERR_TIMEOUT;
    
    /* RTC_TAMP register is not under write protection */
    RTC_TAMP = RTC_REGISTER_RESET;

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* reset RTC_CTL register, this can be done without the init mode */
    RTC_CTL &= RTC_REGISTER_RESET;

    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){
        /* before reset RTC_TIME and RTC_DATE, BPSHAD bit in RTC_CTL should be reset as the condition.
           in order to read calendar from shadow register, not the real registers being reset */
        RTC_TIME = RTC_REGISTER_RESET;
        RTC_DATE = RTC_DATE_RESET;

