SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
        RTC_PSC = RTC_PSC_RESET;

        /* reset RTC_STAT register, also exit init mode.
           at the same time, RTC_STAT_SOPF bit is reset, as the condition to reset RTC_SHIFTCTL register later */
        RTC_STAT = RTC_STAT_RESET;
      
        /* to write RTC_ALRM0SS register, ALRM0EN bit in RTC_CTL register should be reset as the condition */
        RTC_ALRM0TD = RTC_REGISTER_RESET;
        RTC_ALRM0SS = RTC_REGISTER_RESET;

        /* reset RTC_SHIFTCTL and RTC_HRFC register, this can be done without the init mode */
        RTC_SHIFTCTL = RTC_REGISTER_RESET;
        RTC_HRFC = RTC_REGISTER_RESET;

        ret_status = hal_rtc_register_sync_wait();
        if(HAL_ERR_TIMEOUT == ret_status){
            HAL_DEBUGE("rtc register synchronized with APB clock timout");
            return HAL_ERR_TIMEOUT;             
        }
    }else{
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
        
        HAL_DEBUGE("rtc enter init mode timout");
        return HAL_ERR_TIMEOUT;        
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize RTC
    \param[in]  rtc_initpara_struct: pointer to a hal_rtc_init_struct structure which contains 
                parameters for initialization of the rtc peripheral
                members of the structure and the member values are shown as below:
                  rtc_year: 0x0 - 0x99(BCD format)
                  rtc_month: 
                    the argument could be selected from enumeration <hal_rtc_month_enum>
                  rtc_date: 0x1 - 0x31(BCD format)
                  rtc_day_of_week:
                    the argument could be selected from enumeration <hal_rtc_day_of_week_enum>
                  rtc_hour: 0x1 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc_display_format chose
                  rtc_minute: 0x0 - 0x59(BCD format)
                  rtc_second: 0x0 - 0x59(BCD format)
                  rtc_subsecond: 0x0 - 0xFFFF
                  rtc_factor_asyn: 0x0 - 0x7F
                  rtc_factor_syn: 0x0 - 0x7FFF
                  rtc_am_pm: HAL_RTC_AM, HAL_RTC_PM
                  rtc_display_format: HAL_RTC_24HOUR, HAL_RTC_12HOUR
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, HAL_ERR_VAL, HAL_ERR_NONE,
                details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_init(hal_rtc_init_struct* rtc_initpara_struct)
{
    ErrStatus error_status = ERROR;
    int32_t ret_status = HAL_ERR_TIMEOUT;
    uint32_t reg_time = 0x00U, reg_date = 0x00U;
    uint32_t hour_binary = 0x00U, minute_binary = 0x00U, second_binary = 0x00U;
    uint32_t year_binary = 0x00U, date_binary = 0x00U;

#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == rtc_initpara_struct){
        HAL_DEBUGE("pointer [rtc_initpara_struct] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* check parameter rtc_initpara_struct->rtc_year */
    year_binary = rtc_bcd_2_normal(rtc_initpara_struct->rtc_year);
    if(year_binary > 99){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_year] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_initpara_struct->rtc_date */
    date_binary = rtc_bcd_2_normal(rtc_initpara_struct->rtc_date);
    if((date_binary < 1U)||(date_binary > 31U)){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_date] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_initpara_struct->rtc_display_format */
    if((HAL_RTC_24HOUR != rtc_initpara_struct->rtc_display_format)&&(HAL_RTC_12HOUR != rtc_initpara_struct->rtc_display_format)){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_display_format] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_initpara_struct->rtc_hour, and rtc_initpara_struct->rtc_am_pm */
    hour_binary = rtc_bcd_2_normal(rtc_initpara_struct->rtc_hour);
    if(HAL_RTC_12HOUR == rtc_initpara_struct->rtc_display_format){
        
        if((hour_binary < 1U)||(hour_binary > 12U)){
            HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        if((HAL_RTC_AM != rtc_initpara_struct->rtc_am_pm)&&(HAL_RTC_PM != rtc_initpara_struct->rtc_am_pm)){
            HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_am_pm] value is invalid");
            return HAL_ERR_VAL;
        }        
    }else{
        if(hour_binary > 23U){
            HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        rtc_initpara_struct->rtc_am_pm = HAL_RTC_AM;
    }

    /* check parameter rtc_initpara_struct->rtc_minute */
    minute_binary = rtc_bcd_2_normal(rtc_initpara_struct->rtc_minute);
    if(minute_binary > 59){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_minute] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_initpara_struct->rtc_second */
    second_binary = rtc_bcd_2_normal(rtc_initpara_struct->rtc_second);
    if(second_binary > 59){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_second] value is invalid");
        return HAL_ERR_VAL;
    }    

    /* check parameter rtc_initpara_struct->rtc_factor_asyn */
    if(rtc_initpara_struct->rtc_factor_asyn > 0x7F){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_factor_asyn] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_initpara_struct->rtc_factor_syn */
    if(rtc_initpara_struct->rtc_factor_syn > 0x7FFF){
        HAL_DEBUGE("parameter [rtc_initpara_struct->rtc_factor_syn] value is invalid");
        return HAL_ERR_VAL;
    }    
    
    
    reg_date = (DATE_YR(rtc_initpara_struct->rtc_year) | \
                DATE_DOW(rtc_initpara_struct->rtc_day_of_week) | \
                DATE_MON(rtc_initpara_struct->rtc_month) | \
                DATE_DAY(rtc_initpara_struct->rtc_date)); 
    
    reg_time = (rtc_initpara_struct->rtc_am_pm| \
                TIME_HR(rtc_initpara_struct->rtc_hour) | \
                TIME_MN(rtc_initpara_struct->rtc_minute) | \
                TIME_SC(rtc_initpara_struct->rtc_second)); 
              
    /* 1st: disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* 2nd: enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){
        RTC_PSC = (uint32_t)(PSC_FACTOR_A(rtc_initpara_struct->rtc_factor_asyn)| \
                             PSC_FACTOR_S(rtc_initpara_struct->rtc_factor_syn));

        RTC_TIME = (uint32_t)reg_time;
        RTC_DATE = (uint32_t)reg_date;

        RTC_CTL &= (uint32_t)(~RTC_CTL_CS);
        RTC_CTL |=  rtc_initpara_struct->rtc_display_format;
        
        /* 3rd: exit init mode */
        rtc_init_mode_exit();
        
        /* 4th: wait the RSYNF flag to set */
        ret_status = hal_rtc_register_sync_wait();
    }else{
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
        
        HAL_DEBUGE("rtc enter init mode timout");
        return HAL_ERR_TIMEOUT;        
    }

    /* 5th: enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;   

    return ret_status;
}

/*!
    \brief      wait until RTC_TIME and RTC_DATE registers are synchronized with APB clock, and the shadow 
                registers are updated
    \param[in]  none
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_register_sync_wait(void)
{
    volatile uint32_t time_index = RTC_RSYNF_TIMEOUT;
    volatile uint32_t flag_status = RESET;
    volatile int32_t ret_status = HAL_ERR_NONE;

    if((uint32_t)RESET == (RTC_CTL & RTC_CTL_BPSHAD)){
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;

