SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
        /* firstly clear RSYNF flag */
        RTC_STAT &= (uint32_t)(~RTC_STAT_RSYNF);

        /* wait until RSYNF flag to be set */
        do{
            flag_status = rtc_flag_get(RTC_FLAG_RSYN);
        }while((--time_index > 0x00U) && ((uint32_t)RESET == flag_status));

        if((uint32_t)SET != flag_status){
            ret_status = HAL_ERR_TIMEOUT;
        }
        
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
    }

    return ret_status;
}

/*!
    \brief      get current time and date
    \param[in]  none
    \param[out] rtc_initpara_struct: pointer to a hal_rtc_init_struct structure which contains 
                parameters for initialization of the rtc peripheral
                members of the structure and the member values are shown as below:
                  rtc_year: 0x0 - 0x99(BCD format)
                  rtc_month: 
                    the argument could be selected from enumeration <hal_rtc_month_enum>
                  rtc_date: 0x1 - 0x31(BCD format)
                  rtc_day_of_week:
                    the argument could be selected from enumeration <hal_rtc_day_of_week_enum>
                  rtc_hour: 0x1 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc_display_format chose
                  rtc_minute: 0x0 - 0x59(BCD format)
                  rtc_second: 0x0 - 0x59(BCD format)
                  rtc_subsecond: 0x0 - 0xFFFF
                  rtc_factor_asyn: 0x0 - 0x7F
                  rtc_factor_syn: 0x0 - 0x7FFF
                  rtc_am_pm: HAL_RTC_AM, HAL_RTC_PM
                  rtc_display_format: HAL_RTC_24HOUR, HAL_RTC_12HOUR
    \retval     none
*/
void hal_rtc_current_time_get(hal_rtc_init_struct* rtc_initpara_struct)
{
    uint32_t temp_tr = 0x00U, temp_dr = 0x00U, temp_pscr = 0x00U, temp_ctlr = 0x00U;
    uint16_t temp_ss = 0x00U;

    /* if BPSHAD bit is reset, reading RTC_SS will lock RTC_TIME and RTC_DATE automatically */
    temp_ss = (uint16_t)RTC_SS;    
    temp_tr = (uint32_t)RTC_TIME;   
    temp_dr = (uint32_t)RTC_DATE;
    temp_pscr = (uint32_t)RTC_PSC;
    temp_ctlr = (uint32_t)RTC_CTL;
    /* read RTC_DATE to unlock the 3 shadow registers */
    (void) (RTC_DATE);    
  
    /* get current time and construct rtc_parameter_struct structure */
    rtc_initpara_struct->rtc_year = (uint8_t)GET_DATE_YR(temp_dr);
    rtc_initpara_struct->rtc_month = (hal_rtc_month_enum)GET_DATE_MON(temp_dr);
    rtc_initpara_struct->rtc_date = (uint8_t)GET_DATE_DAY(temp_dr);
    rtc_initpara_struct->rtc_day_of_week = (hal_rtc_day_of_week_enum)GET_DATE_DOW(temp_dr);  
    rtc_initpara_struct->rtc_hour = (uint8_t)GET_TIME_HR(temp_tr);
    rtc_initpara_struct->rtc_minute = (uint8_t)GET_TIME_MN(temp_tr);
    rtc_initpara_struct->rtc_second = (uint8_t)GET_TIME_SC(temp_tr);
    rtc_initpara_struct->rtc_subsecond = temp_ss;    
    rtc_initpara_struct->rtc_factor_asyn = (uint16_t)GET_PSC_FACTOR_A(temp_pscr);
    rtc_initpara_struct->rtc_factor_syn = (uint16_t)GET_PSC_FACTOR_S(temp_pscr);
    rtc_initpara_struct->rtc_am_pm = (uint32_t)(temp_pscr & RTC_TIME_PM); 
    rtc_initpara_struct->rtc_display_format = (uint32_t)(temp_ctlr & RTC_CTL_CS);
}

/*!
    \brief      configure RTC alarm
    \param[in]  rtc_alarm_time: pointer to a hal_rtc_alarm_struct structure which contains 
                parameters for RTC alarm configuration
                members of the structure and the member values are shown as below:
                  rtc_alarm_mask: HAL_RTC_ALARM_NONE_MASK, HAL_RTC_ALARM_DATE_MASK, HAL_RTC_ALARM_HOUR_MASK,
                                  HAL_RTC_ALARM_MINUTE_MASK, HAL_RTC_ALARM_SECOND_MASK, HAL_RTC_ALARM_ALL_MASK
                  rtc_weekday_or_date: HAL_RTC_ALARM_DATE_SELECTED, HAL_RTC_ALARM_WEEKDAY_SELECTED
                  rtc_alarm_day: 1) 0x1 - 0x31(BCD format) if RTC_ALARM_DATE_SELECTED is set
                                 2) the argument could be selected from enumeration <hal_rtc_day_of_week_enum> 
                                    if RTC_ALARM_WEEKDAY_SELECTED is set
                  rtc_alarm_hour: 0x1 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc_display_format
                  rtc_alarm_minute: 0x0 - 0x59(BCD format)
                  rtc_alarm_second: 0x0 - 0x59(BCD format)
                  rtc_alarm_subsecond: 0x000 - 0x7FFF
                  rtc_alarm_subsecond_mask: HAL_RTC_MASK_SUBSECOND, HAL_RTC_MASK_SUBSECOND_1_14, HAL_RTC_MASK_SUBSECOND_2_14,
                                            HAL_RTC_MASK_SUBSECOND_3_14, HAL_RTC_MASK_SUBSECOND_4_14, HAL_RTC_MASK_SUBSECOND_5_14,
                                            HAL_RTC_MASK_SUBSECOND_6_14, HAL_RTC_MASK_SUBSECOND_7_14, HAL_RTC_MASK_SUBSECOND_8_14,
                                            HAL_RTC_MASK_SUBSECOND_9_14, HAL_RTC_MASK_SUBSECOND_10_14, HAL_RTC_MASK_SUBSECOND_11_14,
                                            HAL_RTC_MASK_SUBSECOND_12_14, HAL_RTC_MASK_SUBSECOND_13_14, HAL_RTC_MASK_SUBSECOND_14,
                                            HAL_RTC_MASK_SUBSECOND_NONE
                  rtc_am_pm: HAL_RTC_AM, HAL_RTC_PM
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_TIMEOUT, HAL_ERR_NONE,
                details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_alarm_config(hal_rtc_alarm_struct* rtc_alarm_time)
{
    uint32_t reg_alrm0td = 0x00U;
    uint32_t day_binary = 0x00U, hour_binary = 0x00U, minute_binary = 0x00U, second_binary = 0x00U;
    uint32_t rtc_display_format = 0U, subsecond_mask = 0U;

#if (1 == HAL_PARAMETER_CHECK)
    if(NULL == rtc_alarm_time){
        HAL_DEBUGE("pointer [rtc_alarm_time] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check parameter rtc_alarm_time->rtc_alarm_mask */
    if(0x80808080U != (rtc_alarm_time->rtc_alarm_mask | 0x80808080U)){
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_mask] value is invalid");
        return HAL_ERR_VAL;
    } 
    
    rtc_display_format = RTC_CTL & RTC_CTL_CS;
    /* check parameter rtc_alarm_time->rtc_alarm_hour, and rtc_alarm_time->rtc_am_pm */
    hour_binary = rtc_bcd_2_normal(rtc_alarm_time->rtc_alarm_hour);
    if(0U != rtc_display_format){
        
        if((hour_binary < 1U)||(hour_binary > 12U)){
            HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        if((HAL_RTC_AM != rtc_alarm_time->rtc_am_pm)&&(HAL_RTC_PM != rtc_alarm_time->rtc_am_pm)){
            HAL_DEBUGE("parameter [rtc_alarm_time->rtc_am_pm] value is invalid");
            return HAL_ERR_VAL;
        }        
    }else{
        if(hour_binary > 23U){
            HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        rtc_alarm_time->rtc_am_pm = HAL_RTC_AM;
    }

    /* check parameter rtc_alarm_time->rtc_alarm_minute */
    minute_binary = rtc_bcd_2_normal(rtc_alarm_time->rtc_alarm_minute);
    if(minute_binary > 59){
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_minute] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_alarm_time->rtc_alarm_second */
    second_binary = rtc_bcd_2_normal(rtc_alarm_time->rtc_alarm_second);
    if(second_binary > 59){
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_second] value is invalid");
        return HAL_ERR_VAL;
    }   
    
    /* check parameter rtc_alarm_time->rtc_weekday_or_date, and rtc_alarm_time->rtc_alarm_day */
    day_binary = rtc_bcd_2_normal(rtc_alarm_time->rtc_alarm_day);
    if(HAL_RTC_ALARM_DATE_SELECTED == rtc_alarm_time->rtc_weekday_or_date){
        if((day_binary < 1U)||(day_binary > 31U)){
            HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_day] value is invalid");
            return HAL_ERR_VAL;
        }
    }else if(HAL_RTC_ALARM_WEEKDAY_SELECTED == rtc_alarm_time->rtc_weekday_or_date){
        if((day_binary < 1U)||(day_binary > 7U)){
            HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_day] value is invalid");
            return HAL_ERR_VAL;
        }    
    }else{
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_weekday_or_date] value is invalid");
        return HAL_ERR_VAL;    
    }  

    /* check parameter rtc_alarm_time->rtc_alarm_subsecond */
    if(rtc_alarm_time->rtc_alarm_subsecond > 0x7FFFU){
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_subsecond] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_alarm_time->rtc_alarm_subsecond_mask */
    subsecond_mask = rtc_alarm_time->rtc_alarm_subsecond_mask | RTC_ALRM0SS_MASKSSC;
    if(RTC_ALRM0SS_MASKSSC != subsecond_mask){
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_subsecond_mask] value is invalid");
        return HAL_ERR_VAL;
    }    
    
    reg_alrm0td = (rtc_alarm_time->rtc_alarm_mask | \
                 rtc_alarm_time->rtc_weekday_or_date | \
                 rtc_alarm_time->rtc_am_pm | \
                 ALRM0TD_DAY(rtc_alarm_time->rtc_alarm_day) | \
                 ALRM0TD_HR(rtc_alarm_time->rtc_alarm_hour) | \
                 ALRM0TD_MN(rtc_alarm_time->rtc_alarm_minute) | \
                 ALRM0TD_SC(rtc_alarm_time->rtc_alarm_second));

    /* disable RTC alarm */
    if(HAL_ERR_TIMEOUT == hal_rtc_alarm_disable()){
        HAL_DEBUGE("disable RTC alarm timeout");
        return HAL_ERR_TIMEOUT;    
    }    
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;     
    
    RTC_ALRM0TD = (uint32_t)reg_alrm0td;
    RTC_ALRM0SS = rtc_alarm_time->rtc_alarm_subsecond_mask | rtc_alarm_time->rtc_alarm_subsecond;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    
