SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      enable RTC alarm
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_alarm_enable(void)
{

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;     
    
    /* enable RTC alarm */
    RTC_CTL |= RTC_CTL_ALRM0EN;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      configure and enable RTC alarm by interrupt method, the function is non-blocking
    \param[in]  irq_handle: the callback handler of RTC interrupt
                  The structure member can be assigned as following parameters:
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
      \arg        hal_irq_handle_cb function pointer: the function is user customized,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_alarm_enable_interrupt(hal_rtc_irq_handle_cb irq_handle)
{
    if(NULL != irq_handle){
        /* clear alarm event flag */
        RTC_STAT &= (uint32_t)(~RTC_STAT_ALRM0F);
        
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2; 
        
        /* enable alarm interrupt, and configure EXTI line with rising edge */
        rtc_flag_clear(RTC_FLAG_ALARM0);
        RTC_CTL |= RTC_CTL_ALRM0IE;
        hal_exti_internal_init(EXTI_LINE_17_RTC_ALARM, EXTI_INTERRUPT_TRIG_RISING);

        /* enable RTC alarm */
        RTC_CTL |= RTC_CTL_ALRM0EN;
                
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
        
        rtc_irq.alarm_handle = irq_handle;  
    }else{
        HAL_DEBUGE("pointer [irq_handle] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      disable RTC alarm
    \param[in]  none
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_alarm_disable(void)
{
    volatile uint32_t time_index = RTC_ALRM0WF_TIMEOUT;
    int32_t ret_status = HAL_ERR_TIMEOUT;
    uint32_t flag_status = RESET;

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    
    /* clear the state of alarm */
    RTC_CTL &= (uint32_t)(~RTC_CTL_ALRM0EN);

    /* disable alarm interrupt */
    RTC_CTL &= (uint32_t)~RTC_CTL_ALRM0IE;
    rtc_irq.alarm_handle = NULL;
    rtc_flag_clear(RTC_FLAG_ALARM0);
    EXTI_PD = (uint32_t)EXTI_17;    
    
    /* wait until ALRM0WF flag to be set after the alarm is disabled */
    do{
        flag_status = RTC_STAT & RTC_STAT_ALRM0WF;
    }while((--time_index > 0x00U) && ((uint32_t)RESET == flag_status));
    
    if((uint32_t)RESET != flag_status){     
        ret_status = HAL_ERR_NONE;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return ret_status;
}

/*!
    \brief      get RTC alarm
    \param[in]  none
    \param[out] rtc_alarm_time: pointer to a hal_rtc_alarm_struct structure which contains 
                parameters for RTC alarm configuration
                members of the structure and the member values are shown as below:
                  rtc_alarm_mask: HAL_RTC_ALARM_NONE_MASK, HAL_RTC_ALARM_DATE_MASK, HAL_RTC_ALARM_HOUR_MASK,
                                  HAL_RTC_ALARM_MINUTE_MASK, HAL_RTC_ALARM_SECOND_MASK, HAL_RTC_ALARM_ALL_MASK
                  rtc_weekday_or_date: HAL_RTC_ALARM_DATE_SELECTED, HAL_RTC_ALARM_WEEKDAY_SELECTED
                  rtc_alarm_day: 1) 0x1 - 0x31(BCD format) if RTC_ALARM_DATE_SELECTED is set
                                 2) the argument could be selected from enumeration <hal_rtc_day_of_week_enum>
                                    if RTC_ALARM_WEEKDAY_SELECTED is set
                  rtc_alarm_hour: 0x1 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc_display_format
                  rtc_alarm_minute: 0x0 - 0x59(BCD format)
                  rtc_alarm_second: 0x0 - 0x59(BCD format)
                  rtc_alarm_subsecond: 0x000 - 0x7FFF
                  rtc_alarm_subsecond_mask: HAL_RTC_MASK_SUBSECOND, HAL_RTC_MASK_SUBSECOND_1_14, HAL_RTC_MASK_SUBSECOND_2_14,
                                            HAL_RTC_MASK_SUBSECOND_3_14, HAL_RTC_MASK_SUBSECOND_4_14, HAL_RTC_MASK_SUBSECOND_5_14,
                                            HAL_RTC_MASK_SUBSECOND_6_14, HAL_RTC_MASK_SUBSECOND_7_14, HAL_RTC_MASK_SUBSECOND_8_14,
                                            HAL_RTC_MASK_SUBSECOND_9_14, HAL_RTC_MASK_SUBSECOND_10_14, HAL_RTC_MASK_SUBSECOND_11_14,
                                            HAL_RTC_MASK_SUBSECOND_12_14, HAL_RTC_MASK_SUBSECOND_13_14, HAL_RTC_MASK_SUBSECOND_14,
                                            HAL_RTC_MASK_SUBSECOND_NONE
                  rtc_am_pm: HAL_RTC_AM, HAL_RTC_PM
    \retval     none
*/
void hal_rtc_alarm_get(hal_rtc_alarm_struct* rtc_alarm_time)
{
    uint32_t reg_alrm0td = 0x00U, reg_alrm0ss = 0x00U;

    /* get the value of RTC_ALRM0TD and RTC_ALRM0SS register */
    reg_alrm0td = RTC_ALRM0TD;
    reg_alrm0ss = RTC_ALRM0SS;

    /* get alarm parameters and construct the rtc_alarm_struct structure */
    rtc_alarm_time->rtc_alarm_mask = reg_alrm0td & RTC_ALARM_ALL_MASK; 
    rtc_alarm_time->rtc_am_pm = (uint32_t)(reg_alrm0td & RTC_ALRM0TD_PM);
    rtc_alarm_time->rtc_weekday_or_date = (uint32_t)(reg_alrm0td & RTC_ALRM0TD_DOWS);
    rtc_alarm_time->rtc_alarm_day = (uint8_t)GET_ALRM0TD_DAY(reg_alrm0td);
    rtc_alarm_time->rtc_alarm_hour = (uint8_t)GET_ALRM0TD_HR(reg_alrm0td);
    rtc_alarm_time->rtc_alarm_minute = (uint8_t)GET_ALRM0TD_MN(reg_alrm0td);
    rtc_alarm_time->rtc_alarm_second = (uint8_t)GET_ALRM0TD_SC(reg_alrm0td);
    rtc_alarm_time->rtc_alarm_subsecond = reg_alrm0ss & RTC_ALRM0SS_SSC;    
}

/*!
    \brief      poll for RTC alarm event, the function is blocking
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_alarm_event_poll(uint32_t timeout_ms)
{    
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;
    
    tick_start = hal_basetick_count_get();
    /* wait until ALRM0F flag to be set after the alarm is enabled */
    do{
        flag_status = RTC_STAT & RTC_STAT_ALRM0F;
    }while((SET == hal_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status));
    
