SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
    if((uint32_t)RESET == flag_status){     
        return HAL_ERR_TIMEOUT;
    }
    
    rtc_flag_clear(RTC_FLAG_ALARM0);
    return HAL_ERR_NONE;
}

#if defined(GD32E230)
/*!
    \brief      configure RTC time-stamp
    \param[in]  edge: specify which edge to detect of time-stamp
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_TIMESTAMP_RISING_EDGE: rising edge is valid event edge for timestamp event
      \arg        HAL_RTC_TIMESTAMP_FALLING_EDGE: falling edge is valid event edge for timestamp event
    \param[out] none
    \retval     error code: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_timestamp_config(uint32_t edge)
{
    uint32_t reg_ctl = 0x00U;
    
#if (1 == HAL_PARAMETER_CHECK)
    if((HAL_RTC_TIMESTAMP_RISING_EDGE != edge) && (HAL_RTC_TIMESTAMP_FALLING_EDGE != edge)){
        HAL_DEBUGE("parameter [edge] value is invalid");
        return HAL_ERR_VAL;    
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* clear the bits to be configured in RTC_CTL */
    reg_ctl = (uint32_t)(RTC_CTL & (uint32_t)(~(RTC_CTL_TSEG | RTC_CTL_TSEN)));

    /* new configuration */
    reg_ctl |= (uint32_t)edge;
   
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL = (uint32_t)reg_ctl;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      enable RTC time-stamp
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_timestamp_enable(void)
{   
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL |= RTC_CTL_TSEN;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      enable RTC time-stamp by interrupt method, the function is non-blocking
    \param[in]  irq_handle: the callback handler of RTC interrupt
                  The structure member can be assigned as following parameters:
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
      \arg        hal_irq_handle_cb function pointer: the function is user customized,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_timestamp_enable_interrupt(hal_rtc_irq_handle_cb irq_handle)
{   
    if(NULL != irq_handle){
        /* disable the write protection */
        RTC_WPK = RTC_UNLOCK_KEY1;
        RTC_WPK = RTC_UNLOCK_KEY2;
  
        /* enable timestamp interrupt, and configure EXTI line with rising edge */
        rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);        
        RTC_CTL |= RTC_CTL_TSIE;
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING); 

        RTC_CTL |= RTC_CTL_TSEN;
             
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;
        
        rtc_irq.timestamp_handle = irq_handle;              
    }else{
        HAL_DEBUGE("pointer [irq_handle] address is invalid");
        return HAL_ERR_ADDRESS;    
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      disable RTC time-stamp
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_timestamp_disable(void)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    
    /* clear the TSEN bit */
    RTC_CTL &= (uint32_t)(~(RTC_CTL_TSEG | RTC_CTL_TSEN));
    
    /* disable timestamp interrupt */
    RTC_CTL &= ~RTC_CTL_TSIE;
    rtc_irq.timestamp_handle = NULL;
    rtc_flag_clear(RTC_FLAG_TIMESTAMP);
    rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
    EXTI_PD = (uint32_t)EXTI_19;     

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}
#endif /* GD32E230 */

/*!
    \brief      get RTC timestamp time and date
    \param[in]  none
    \param[out] rtc_timestamp: pointer to a hal_rtc_timestamp_struct structure which contains 
                parameters for RTC time-stamp configuration
                members of the structure and the member values are shown as below:
                  rtc_timestamp_month: RTC_JAN, RTC_FEB, RTC_MAR, RTC_APR, RTC_MAY, RTC_JUN,
                                       RTC_JUL, RTC_AUG, RTC_SEP, RTC_OCT, RTC_NOV, RTC_DEC
                  rtc_timestamp_date: 0x1 - 0x31(BCD format)
                  rtc_timestamp_day: RTC_MONDAY, RTC_TUESDAY, RTC_WEDSDAY, RTC_THURSDAY, RTC_FRIDAY,
                                     RTC_SATURDAY, RTC_SUNDAY if RTC_ALARM_WEEKDAY_SELECTED is set
                  rtc_timestamp_hour: 0x0 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc_display_format
                  rtc_timestamp_minute: 0x0 - 0x59(BCD format)
                  rtc_timestamp_second: 0x0 - 0x59(BCD format)
                  rtc_timestamp_subsecond: 0x0 - 0xFFFF
                  rtc_am_pm: HAL_RTC_AM, HAL_RTC_PM
    \retval     none
*/
void hal_rtc_timestamp_get(hal_rtc_timestamp_struct* rtc_timestamp)
{
    uint32_t temp_tts = 0x00U, temp_dts = 0x00U,temp_ssts = 0x00U;

    /* get the value of time_stamp registers */
    temp_tts = (uint32_t)RTC_TTS;
    temp_dts = (uint32_t)RTC_DTS;
    temp_ssts = (uint32_t)RTC_SSTS;
  
    /* get timestamp time and construct the rtc_timestamp_struct structure */
    rtc_timestamp->rtc_am_pm = (uint32_t)(temp_tts & RTC_TTS_PM);
    rtc_timestamp->rtc_timestamp_month = (uint8_t)GET_DTS_MON(temp_dts);
    rtc_timestamp->rtc_timestamp_date = (uint8_t)GET_DTS_DAY(temp_dts);
    rtc_timestamp->rtc_timestamp_day = (uint8_t)GET_DTS_DOW(temp_dts);
    rtc_timestamp->rtc_timestamp_hour = (uint8_t)GET_TTS_HR(temp_tts);
    rtc_timestamp->rtc_timestamp_minute = (uint8_t)GET_TTS_MN(temp_tts);
    rtc_timestamp->rtc_timestamp_second = (uint8_t)GET_TTS_SC(temp_tts);
    rtc_timestamp->rtc_timestamp_subsecond = temp_ssts;
}

/*!
    \brief      configure RTC tamper
    \param[in]  rtc_tamper: pointer to a hal_rtc_tamper_struct structure which contains 
                parameters for RTC tamper configuration
                members of the structure and the member values are shown as below:
                  rtc_tamper_source: HAL_RTC_TAMPER0, HAL_RTC_TAMPER1,(HAL_RTC_TAMPER0 only for GD32E230)
                  rtc_tamper_trigger: HAL_RTC_TAMPER_EDGE_RISING, HAL_RTC_TAMPER_EDGE_FALLING,
                                      HAL_RTC_TAMPER_LEVEL_LOW, HAL_RTC_TAMPER_LEVEL_HIGH
                  rtc_tamper_filter: HAL_RTC_FILTER_EDGE, HAL_RTC_FILTER_2_SAMPLE, HAL_RTC_FILTER_4_SAMPLE,
                                     HAL_RTC_FILTER_8_SAMPLE
                  rtc_tamper_sample_frequency: 
                    the argument could be selected from enumeration <hal_rtc_tamper_freq_enum>
                  rtc_tamper_precharge_enable: DISABLE, ENABLE
                  rtc_tamper_precharge_time: HAL_RTC_1_CLK_PRECHARGE, HAL_RTC_2_CLK_PRECHARGE, HAL_RTC_4_CLK_PRECHARGE,
                                             HAL_RTC_8_CLK_PRECHARGE
                  rtc_tamper_with_timestamp: DISABLE, ENABLE
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_tamper_config(hal_rtc_tamper_struct* rtc_tamper)
{
#if (1 == HAL_PARAMETER_CHECK)
    uint32_t val_mask = 0x0U;
    
    if(NULL == rtc_tamper){
        HAL_DEBUGE("pointer [rtc_tamper] address is invalid");
        return HAL_ERR_ADDRESS;
    }    

