SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
    /* check parameter rtc_tamper->rtc_tamper_source */
    if((HAL_RTC_TAMPER0 != rtc_tamper->rtc_tamper_source)&&(HAL_RTC_TAMPER1 != rtc_tamper->rtc_tamper_source)){
        HAL_DEBUGE("parameter [rtc_tamper->rtc_tamper_source] value is invalid");
        return HAL_ERR_VAL;
    } 

    /* check parameter rtc_tamper->rtc_tamper_trigger */
    val_mask = rtc_tamper->rtc_tamper_trigger | RTC_TAMP_TP0EG;
    if(RTC_TAMP_TP0EG != val_mask){
        HAL_DEBUGE("parameter [rtc_tamper->rtc_tamper_trigger] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_tamper->rtc_tamper_filter */
    val_mask = rtc_tamper->rtc_tamper_filter | RTC_TAMP_FLT;
    if(RTC_TAMP_FLT != val_mask){
        HAL_DEBUGE("parameter [rtc_tamper->rtc_tamper_filter] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter rtc_tamper->rtc_tamper_precharge_enable */
    if((DISABLE != rtc_tamper->rtc_tamper_precharge_enable)&&(ENABLE != rtc_tamper->rtc_tamper_precharge_enable)){
        HAL_DEBUGE("parameter [rtc_tamper->rtc_tamper_precharge_enable] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_tamper->rtc_tamper_precharge_time */
    val_mask = rtc_tamper->rtc_tamper_precharge_time | RTC_TAMP_PRCH;
    if(RTC_TAMP_PRCH != val_mask){
        HAL_DEBUGE("parameter [rtc_tamper->rtc_tamper_precharge_time] value is invalid");
        return HAL_ERR_VAL;
    }    

    /* check parameter rtc_tamper->rtc_tamper_with_timestamp */
    if((DISABLE != rtc_tamper->rtc_tamper_with_timestamp)&&(ENABLE != rtc_tamper->rtc_tamper_with_timestamp)){
        HAL_DEBUGE("parameter [rtc_tamper->rtc_tamper_with_timestamp] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable tamper */
    RTC_TAMP &= (uint32_t)~(rtc_tamper->rtc_tamper_source); 

    /* tamper filter must be used when the tamper source is voltage level detection */
    RTC_TAMP &= (uint32_t)~RTC_TAMP_FLT;
    
    /* the tamper source is voltage level detection */
    if(RTC_FLT_EDGE !=  rtc_tamper->rtc_tamper_filter){ 
        RTC_TAMP &= (uint32_t)~(RTC_TAMP_DISPU | RTC_TAMP_PRCH | RTC_TAMP_FREQ | RTC_TAMP_FLT);

        /* check if the tamper pin need precharge, if need, then configure the precharge time */
        if(DISABLE == rtc_tamper->rtc_tamper_precharge_enable){
            RTC_TAMP |=  (uint32_t)RTC_TAMP_DISPU;    
        }else{
            RTC_TAMP |= (uint32_t)(rtc_tamper->rtc_tamper_precharge_time);
        }

        RTC_TAMP |= (uint32_t)(rtc_tamper->rtc_tamper_sample_frequency);
        RTC_TAMP |= (uint32_t)(rtc_tamper->rtc_tamper_filter);
    }
    
    RTC_TAMP &= (uint32_t)~RTC_TAMP_TPTS;  
    
    if(DISABLE != rtc_tamper->rtc_tamper_with_timestamp){           
        /* the tamper event also cause a time-stamp event */
        RTC_TAMP |= (uint32_t)RTC_TAMP_TPTS;
    } 
    
    /* configure the tamper trigger */
    RTC_TAMP &= ((uint32_t)~((rtc_tamper->rtc_tamper_source) << RTC_TAMPER_TRIGGER_POS));    
    if(RTC_TAMPER_TRIGGER_EDGE_RISING != rtc_tamper->rtc_tamper_trigger){
        RTC_TAMP |= (uint32_t)((rtc_tamper->rtc_tamper_source)<< RTC_TAMPER_TRIGGER_POS);  
    }    

    return HAL_ERR_NONE;
}


/*!
    \brief      enable RTC tamper
    \param[in]  source: specify which tamper source to be enabled
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_TAMPER0
      \arg        HAL_RTC_TAMPER1
    \param[out] none
    \retval     error code: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_tamper_enable(uint32_t source)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter source */
    if((HAL_RTC_TAMPER0 != source)&&(HAL_RTC_TAMPER1 != source)){
        HAL_DEBUGE("parameter [source] value is invalid");
        return HAL_ERR_VAL;
    } 
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* enable tamper */
    RTC_TAMP |= source;

    return HAL_ERR_NONE;
}

/*!
    \brief      enable RTC tamper by interrupt method, the function is non-blocking
    \param[in]  source: specify which tamper source to be enabled
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_TAMPER0
      \arg        HAL_RTC_TAMPER1
    \param[in]  irq_handle: the callback handler of RTC interrupt
                  The structure member can be assigned as following parameters:
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
      \arg        hal_irq_handle_cb function pointer: the function is user customized,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
    \param[out] none
    \retval     error code: HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_tamper_enable_interrupt(uint32_t source, hal_rtc_irq_handle_cb irq_handle)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter source */
    if((HAL_RTC_TAMPER0 != source)&&(HAL_RTC_TAMPER1 != source)){
        HAL_DEBUGE("parameter [source] value is invalid");
        return HAL_ERR_VAL;
    } 
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    if(NULL != irq_handle){
        /* enable tamper interrupt, and configure EXTI line with rising edge */
        if(HAL_RTC_TAMPER1 == source){
            rtc_flag_clear(RTC_FLAG_TAMP1);        
        }
#if defined(GD32E230)
        else{

            rtc_flag_clear(RTC_FLAG_TAMP0);         
        }
        
        if(RESET != (RTC_TAMP & RTC_TAMP_TPTS)){
            rtc_flag_clear(RTC_FLAG_TIMESTAMP);
            rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);        
        }        
        RTC_TAMP |= RTC_TAMP_TPIE;
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING);
#endif /* GD32E230 */
        /* enable tamper */
        RTC_TAMP |= source;
        
        if(HAL_RTC_TAMPER1 == source){
            rtc_irq.tamper1_handle = irq_handle;     
        }else{
            rtc_irq.tamper0_handle = irq_handle;    
        }
    }else{
        HAL_DEBUGE("pointer [irq_handle] address is invalid");
        return HAL_ERR_ADDRESS;    
    }   
    return HAL_ERR_NONE;
}

/*!
    \brief      disable RTC tamper
    \param[in]  source: specify which tamper source to be disabled
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_TAMPER0
      \arg        HAL_RTC_TAMPER1
    \param[out] none
    \retval     error code: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_tamper_disable(uint32_t source)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter source */
    if((HAL_RTC_TAMPER0 != source)&&(HAL_RTC_TAMPER1 != source)){
        HAL_DEBUGE("parameter [source] value is invalid");
        return HAL_ERR_VAL;
    } 
#endif /* 1 == HAL_PARAMETER_CHECK */
    
