SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
    /* disable tamper */    
    RTC_TAMP &= (uint32_t)~source;
    RTC_TAMP &= ~RTC_TAMP_TPIE;
    if(HAL_RTC_TAMPER1 == source){
        rtc_irq.tamper1_handle = NULL;
        rtc_flag_clear(RTC_FLAG_TAMP1);         
    }else{
#if defined(GD32E230)
        rtc_irq.tamper0_handle = NULL;
        rtc_flag_clear(RTC_FLAG_TAMP0);
#endif /* GD32E230 */
    }
#if defined(GD32E230)
    if(RESET != (RTC_TAMP & RTC_TAMP_TPTS)){
        rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);        
    }
#endif /* GD32E230 */
    EXTI_PD = (uint32_t)EXTI_19;

    return HAL_ERR_NONE;    
}

#if defined(GD32E230)
/*!
    \brief      poll for RTC timestamp event, the function is blocking
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_HARDWARE, HAL_ERR_NONE,
                details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_timestamp_event_poll(uint32_t timeout_ms)
{  
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;
    
    /* wait until TSF flag to be set */
    flag_status = RTC_STAT & RTC_STAT_TSF;
    tick_start = hal_basetick_count_get();
    while((SET == hal_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status)){
        flag_status = RTC_STAT & RTC_STAT_TSF;
        if((uint32_t)RESET != (RTC_STAT & RTC_STAT_TSOVRF)){
            return HAL_ERR_HARDWARE;
        }
    }
    
    if((uint32_t)RESET == flag_status){     
        return HAL_ERR_TIMEOUT;
    }
    
    rtc_flag_clear(RTC_FLAG_TIMESTAMP);
    rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      poll for RTC tamper0 event, the function is blocking
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_tamper0_event_poll(uint32_t timeout_ms)
{  
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;
    
    tick_start = hal_basetick_count_get();
    /* wait until TP0F flag to be set */
    do{
        flag_status = RTC_STAT & RTC_STAT_TP0F;
    }while((SET == hal_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status));
    
    if((uint32_t)RESET == flag_status){     
        return HAL_ERR_TIMEOUT;
    }
    
    rtc_flag_clear(RTC_FLAG_TAMP0);
    
    return HAL_ERR_NONE;
}
#endif /* GD32E230 */

/*!
    \brief      poll for RTC tamper1 event, the function is blocking
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_tamper1_event_poll(uint32_t timeout_ms)
{   
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;

    tick_start = hal_basetick_count_get();
    /* wait until TP1F flag to be set */
    do{
        flag_status = RTC_STAT & RTC_STAT_TP1F;
    }while((SET == hal_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status));
    
    if((uint32_t)RESET == flag_status){     
        return HAL_ERR_TIMEOUT;
    }
    
    rtc_flag_clear(RTC_FLAG_TAMP1);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      RTC interrupt handler content function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_irq(void)
{
    uint32_t int_en = 0U;
    
    /* alarm interrupt handle */
    int_en = RTC_CTL & RTC_CTL_ALRM0IE;
    if((RESET != rtc_flag_get(RTC_FLAG_ALARM0)) && (RESET != int_en)){
        rtc_flag_clear(RTC_FLAG_ALARM0);
        EXTI_PD = (uint32_t)EXTI_17;
        
        if(NULL != rtc_irq.alarm_handle){
            rtc_irq.alarm_handle();
        }        
    }
#if defined(GD32E230)
    /* timestamp interrupt handle */
    int_en = RTC_CTL & RTC_CTL_TSIE;
    if((RESET != rtc_flag_get(RTC_FLAG_TIMESTAMP)) && (RESET != int_en)){
        if(NULL != rtc_irq.timestamp_handle){
            rtc_irq.timestamp_handle();
        }        
        
        rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
        EXTI_PD = (uint32_t)EXTI_19;              
    }
    
    /* tamper0 interrupt handle */
    int_en = RTC_TAMP & RTC_TAMP_TPIE;
    if((RESET != rtc_flag_get(RTC_FLAG_TAMP0)) && (RESET != int_en)){
        rtc_flag_clear(RTC_FLAG_TAMP0);
        
        if(NULL != rtc_irq.tamper0_handle){
            rtc_irq.tamper0_handle();
        }
        
        rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);        
        EXTI_PD = (uint32_t)EXTI_19;
               
    }
#endif /* GD32E230 */
    /* tamper1 interrupt handle */
    int_en = RTC_TAMP & RTC_TAMP_TPIE;
    if((RESET != rtc_flag_get(RTC_FLAG_TAMP1)) && (RESET != int_en)){
        rtc_flag_clear(RTC_FLAG_TAMP1);
        
        if(NULL != rtc_irq.tamper1_handle){
            rtc_irq.tamper1_handle();
        } 
#if defined(GD32E230)
        rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
#endif /* GD32E230 */
        EXTI_PD = (uint32_t)EXTI_19;
               
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  p_irq: the structure that contains callback handlers of RTC interrupt
                  The structure member can be assigned as following parameters:
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
      \arg        hal_irq_handle_cb function pointer: the function is user customized,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_rtc_irq_handle_set(hal_rtc_irq_struct *p_irq)
{
    if(NULL != p_irq->alarm_handle){
        /* enable alarm interrupt, and configure EXTI line with rising edge */
        RTC_CTL |= RTC_CTL_ALRM0IE;
        hal_exti_internal_init(EXTI_LINE_17_RTC_ALARM, EXTI_INTERRUPT_TRIG_RISING);
        
