SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
        rtc_irq.alarm_handle = p_irq->alarm_handle; 
    }else{
        RTC_CTL &= (uint32_t)~RTC_CTL_ALRM0IE;
        EXTI_INTEN &= (uint32_t)~EXTI_17;
        
        rtc_irq.alarm_handle = NULL; 
    }
#if defined(GD32E230)
    if(NULL != p_irq->timestamp_handle){
        /* enable timestamp interrupt, and configure EXTI line with rising edge */
        RTC_CTL |= RTC_CTL_TSIE;
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING);

        rtc_irq.timestamp_handle = p_irq->timestamp_handle;        
    }else{
        RTC_CTL &= (uint32_t)~RTC_CTL_TSIE;
        
        rtc_irq.timestamp_handle = NULL;         
    }
#endif /* GD32E230 */
    if(NULL != p_irq->tamper0_handle){
        /* enable tamper0 interrupt, and configure EXTI line with rising edge */
        RTC_TAMP |= RTC_TAMP_TPIE;
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING);

        rtc_irq.tamper0_handle = p_irq->tamper0_handle;          
    }else{
        rtc_irq.tamper0_handle = NULL;    
    }

    if(NULL != p_irq->tamper1_handle){
        /* enable tamper1 interrupt, and configure EXTI line with rising edge */
        RTC_TAMP |= RTC_TAMP_TPIE;
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING); 

        rtc_irq.tamper1_handle = p_irq->tamper1_handle;          
    }else{
        rtc_irq.tamper1_handle = NULL;    
    }

    if((NULL == p_irq->tamper0_handle)&&(NULL == p_irq->tamper1_handle)){
        RTC_CTL &= (uint32_t)~RTC_TAMP_TPIE;   
    }
    
    if((NULL == p_irq->tamper0_handle)&&(NULL == p_irq->tamper1_handle)&&(NULL == p_irq->timestamp_handle)){
        EXTI_INTEN &= (uint32_t)~EXTI_19;   
    }    
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_irq_handle_all_reset(void)
{
    rtc_irq.alarm_handle = NULL; 
    rtc_irq.timestamp_handle = NULL;         
    rtc_irq.tamper0_handle = NULL;    
    rtc_irq.tamper1_handle = NULL;    
}

/*!
    \brief      write data to backup register
    \param[in]  backup_index: the index of backup register
      \arg        0 - 4
    \param[in]  data: the data to be written to backup register
      \arg        0x0 - 0xFFFFFFFF
    \param[out] none
    \retval     error code: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_backup_data_write(uint32_t backup_index, uint32_t data)
{
    uint32_t reg = 0x00U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter backup_index */
    if(backup_index > 4U){
        HAL_DEBUGE("parameter [backup_index] value is invalid");
        return HAL_ERR_VAL;
    }    
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    reg = RTC_BKP0 + (backup_index << 2);
    *(__IO uint32_t *)reg = data;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      read data from backup register
    \param[in]  backup_index: the index of backup register
      \arg        0 - 4
    \param[out] data: the data read from backup register
      \arg        0x0 - 0xFFFFFFFF
    \retval     error code: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_backup_data_read(uint32_t backup_index, uint32_t *data)
{
    uint32_t reg = 0x00U;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter backup_index */
    if(backup_index > 4U){
        HAL_DEBUGE("parameter [backup_index] value is invalid");
        return HAL_ERR_VAL;
    } 
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    reg = RTC_BKP0 + (backup_index << 2);
    *data = (*(__IO uint32_t *)reg);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      enable RTC bypass shadow registers function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_bypass_shadow_enable(void)
{ 
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL |= (uint8_t)RTC_CTL_BPSHAD;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      disable RTC bypass shadow registers function
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hal_rtc_bypass_shadow_disable(void)
{ 
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL &= (uint8_t)~RTC_CTL_BPSHAD;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

#if defined(GD32E230)
/*!
    \brief      enable RTC reference clock detection function
    \param[in]  none
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_refclock_detection_enable(void)
{
    ErrStatus error_status = ERROR;
    int32_t ret_status = HAL_ERR_TIMEOUT;
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){
        RTC_CTL |= (uint32_t)RTC_CTL_REFEN;
        /* exit init mode */
        rtc_init_mode_exit();
        
        ret_status = HAL_ERR_NONE;
    }else{
        HAL_DEBUGE("rtc enter init mode timeout");
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return ret_status;
}

/*!
    \brief      disable RTC reference clock detection function
    \param[in]  none
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_refclock_detection_disable(void)
{
    ErrStatus error_status = ERROR;
    int32_t ret_status = HAL_ERR_TIMEOUT;
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* enter init mode */
    error_status = rtc_init_mode_enter();

    if(ERROR != error_status){ 
        RTC_CTL &= (uint32_t)~RTC_CTL_REFEN;
        /* exit init mode */
        rtc_init_mode_exit();
    
