SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
        ret_status = HAL_ERR_NONE;
    }else{
        HAL_DEBUGE("rtc enter init mode timeout");
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return ret_status;
}

/*!
    \brief      configure rtc alternate output source
    \param[in]  source: specify signal to output
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_CALIBRATION_OUT_512HZ: when the LSE freqency is 32768Hz and the RTC_PSC 
                                         is the default value, output 512Hz signal
      \arg        HAL_RTC_CALIBRATION_OUT_1HZ: when the LSE freqency is 32768Hz and the RTC_PSC 
                                       is the default value, output 512Hz signal
      \arg        HAL_RTC_CALIBRATION_OUT_DISABLE: calibration output is disabled
      \arg        HAL_RTC_ALARM_OUT_HIGH: when the  alarm flag is set, the output pin is high
      \arg        HAL_RTC_ALARM_OUT_LOW: when the  Alarm flag is set, the output pin is low
      \arg        HAL_RTC_ALARM_OUT_DISABLE: disable alarm flag output
    \param[in]  mode: specify the output pin (PC13) mode when output alarm signal
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_ALARM_OUTPUT_OD: open drain mode
      \arg        HAL_RTC_ALARM_OUTPUT_PP: push pull mode
    \param[out] none
    \retval     error code: HAL_ERR_VAL, HAL_ERR_NONE, details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_output_config(uint32_t source, uint32_t mode)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter add */
    if((HAL_RTC_CALIBRATION_OUT_512HZ != source)&&(HAL_RTC_CALIBRATION_OUT_1HZ != source)&& \
       (HAL_RTC_ALARM_OUT_HIGH != source)&&(HAL_RTC_ALARM_OUT_LOW != source)&& \
       (HAL_RTC_CALIBRATION_OUT_DISABLE != source)&&(HAL_RTC_ALARM_OUT_DISABLE != source)){
        HAL_DEBUGE("parameter [source] value is invalid");
        return HAL_ERR_VAL;
    } 

    /* check parameter mode */
    if((HAL_RTC_ALARM_OUTPUT_OD != mode)&&(HAL_RTC_ALARM_OUTPUT_PP != mode)){
        HAL_DEBUGE("parameter [mode] value is invalid");
        return HAL_ERR_VAL;
    } 
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* disable calibration output */
    if(HAL_RTC_CALIBRATION_OUT_DISABLE == source){
        RTC_CTL &= (uint32_t)~RTC_CTL_COEN;
    /* disable alarm output */    
    }else if(HAL_RTC_CALIBRATION_OUT_DISABLE == source){
        RTC_CTL &= (uint32_t)~RTC_CTL_OS;
    /* alarm/calibration output */    
    }else{
        RTC_CTL &= (uint32_t)~(RTC_CTL_COEN | RTC_CTL_OS | RTC_CTL_OPOL | RTC_CTL_COS);
        RTC_CTL |= (uint32_t)(source);
    }
    /* alarm output */
    if((uint32_t)RESET != (source & RTC_OS_ENABLE)){
        RTC_TAMP &= (uint32_t)~(RTC_TAMP_PC13VAL);
        RTC_TAMP |= (uint32_t)(mode);  
    }
    
    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    
    return HAL_ERR_NONE;
}
#endif /* GD32E230 */

/*!
    \brief      configure RTC calibration register
    \param[in]  window: select calibration window
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_CALIBRATION_32S: 2exp20 RTCCLK cycles, 32s if RTCCLK = 32768 Hz
      \arg        HAL_RTC_CALIBRATION_16S: 2exp19 RTCCLK cycles, 16s if RTCCLK = 32768 Hz
      \arg        HAL_RTC_CALIBRATION_8S: 2exp18 RTCCLK cycles, 8s if RTCCLK = 32768 Hz
    \param[in]  plus: add RTC clock or not
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_CALIBRATION_PLUS_SET: add one RTC clock every 2048 rtc clock
      \arg        HAL_RTC_CALIBRATION_PLUS_RESET: no effect
    \param[in]  minus: the RTC clock to minus during the calibration window(0x0 - 0x1FF)
    \param[out] none
    \retval     error code: HAL_ERR_VAL, HAL_ERR_TIMEOUT, HAL_ERR_NONE,
                details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_calibration_config(uint32_t window, uint32_t plus, uint32_t minus)
{
    uint32_t time_index = RTC_HRFC_TIMEOUT;
    int32_t ret_status = HAL_ERR_TIMEOUT;
    uint32_t flag_status = RESET;

#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter window */
    if((HAL_RTC_CALIBRATION_32S != window)&&(HAL_RTC_CALIBRATION_16S != window)&&(HAL_RTC_CALIBRATION_8S != window)){
        HAL_DEBUGE("parameter [window] value is invalid");
        return HAL_ERR_VAL;
    }    

    /* check parameter plus */
    if((HAL_RTC_CALIBRATION_PLUS_SET != plus)&&(HAL_RTC_CALIBRATION_PLUS_RESET != plus)){
        HAL_DEBUGE("parameter [plus] value is invalid");
        return HAL_ERR_VAL;
    }
    
    /* check parameter minus */
    if(minus > 0x1FFU){
        HAL_DEBUGE("parameter [minus] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;    
    
    /* check if a calibration operation is ongoing */        
    do{
        flag_status = RTC_STAT & RTC_STAT_SCPF;
    }while((--time_index > 0x00U) && ((uint32_t)RESET != flag_status));
    
    if((uint32_t)RESET == flag_status){
        RTC_HRFC = (uint32_t)(window | plus | HRFC_CMSK(minus));
        ret_status = HAL_ERR_NONE;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return ret_status;
}

/*!
    \brief      ajust the daylight saving time by adding or substracting one hour from the current time
    \param[in]  operation: hour ajustment operation
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_DAYLIGHTSAVING_1HOUR_ADD: add one hour
      \arg        HAL_RTC_DAYLIGHTSAVING_1HOUR_SUBTRACT: substract one hour
      \arg        HAL_RTC_DAYLIGHTSAVING_NONE: no add or subtract one hour
    \param[in]  record: daylight saving mark operation
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_RECORD_DAYLIGHTSAVING_SET: set daylight saving mark
      \arg        HAL_RTC_RECORD_DAYLIGHTSAVING_RESET: reset daylight saving mark
    \param[out] none
    \retval     none
*/
void hal_rtc_daylight_saving_time_adjust(uint32_t operation, uint32_t record)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

