SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_rtc.c
    RTC_CTL &= (uint32_t)(~(RTC_CTL_A1H | RTC_CTL_S1H | RTC_CTL_DSM));
    RTC_CTL |= (uint32_t)(operation | record);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}


/*!
    \brief      ajust RTC second or subsecond value of current time
    \param[in]  add: add 1s to current time or not
                only one parameter can be selected which is shown as below:
      \arg        HAL_RTC_ADD1S_RESET: no effect
      \arg        HAL_RTC_ADD1S_SET: add 1s to current time
    \param[in]  minus: number of subsecond to minus from current time(0x0 - 0x7FFF)
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_NO_SUPPORT, HAL_ERR_TIMEOUT, HAL_ERR_VAL,
                details refer to gd32e23x_hal.h
*/
int32_t hal_rtc_sync_with_remote_clock_adjust(uint32_t add, uint32_t minus)
{
    uint32_t time_index = RTC_SHIFTCTL_TIMEOUT;
    int32_t ret_status = HAL_ERR_NONE;
    uint32_t flag_status = RESET;
    uint32_t temp=0U;

#if (1 == HAL_PARAMETER_CHECK)
    /* check parameter add */
    if((HAL_RTC_ADD1S_RESET != add)&&(HAL_RTC_ADD1S_SET != add)){
        HAL_DEBUGE("parameter [add] value is invalid");
        return HAL_ERR_VAL;
    }    

    /* check parameter minus */
    if(minus > 0x7FFFU){
        HAL_DEBUGE("parameter [minus] value is invalid");
        return HAL_ERR_VAL;
    }    
#endif /* 1 == HAL_PARAMETER_CHECK */
    
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    
    /* check if a shift operation is ongoing */    
    do{
        flag_status = RTC_STAT & RTC_STAT_SOPF;
    }while((--time_index > 0x00U) && ((uint32_t)RESET != flag_status));
  
    temp = RTC_CTL & RTC_CTL_REFEN;
    /* check if the function of reference clock detection is disabled */
    if(((uint32_t)RESET == flag_status) && (RESET == temp)){  
        RTC_SHIFTCTL = (uint32_t)(add | SHIFTCTL_SFS(minus));
        if((uint32_t)RESET == (RTC_CTL & RTC_CTL_BPSHAD)){
            ret_status = hal_rtc_register_sync_wait();
        }            
    }else if(((uint32_t)RESET == flag_status) && (RESET != temp)){
        HAL_DEBUGE("reference clock detection function is enabled ");
        ret_status = HAL_ERR_NO_SUPPORT;
    }else{
        HAL_DEBUGE("shift operation timeout ");
        ret_status = HAL_ERR_TIMEOUT;    
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    return ret_status;
}

/*!
    \brief      convert from  BCD format to binary format
    \param[in]  data: data to be converted
    \param[out] none
    \retval     converted data
*/
uint8_t rtc_bcd_2_normal(uint8_t data)
{
    uint8_t temp = 0U;
    temp = ((uint8_t)(data & (uint8_t)0xF0) >> (uint8_t)0x4) * 10;
    return (temp + (data & (uint8_t)0x0F));
}

/*!
    \brief      convert from  BCD format to binary format
    \param[in]  data: data to be converted
    \param[out] none
    \retval     converted data
*/
uint8_t rtc_normal_2_bcd(uint8_t data)
{
    uint8_t bcd_high = 0;

    while (data >= 10){
        bcd_high++;
        data -= 10;
    }

    return  ((uint8_t)(bcd_high << 4) | data);
}
